In [2]:
import pandas as pd
import os
import shutil as s

In [2]:
#This is a tool for data processing that helps in data analysis. it provides functions and methods to efficiently manipulate large datasets.

#pandas is a dataframe. it is like an excel spreadsheet optimized to run a larger dataset

#Data structures in pandas are *Series (one-dimensional array) *DataFrame (two-dimensional array)

#Series is a one-dimesional array with labels that contain any datatypes including integers

In [3]:
#Checking pandas version

print(pd.__version__)

1.4.2

#Series create, manipulate, query, delete

In [4]:
#Creating a series from a list

arr = [0,1,2,3,4]
a = pd.Series(arr)
a

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [5]:
order = [1,2,3,4,5]
b = pd.Series(arr, index=order)
b

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [6]:
import numpy as np

b = np.random.randn(5) #creating a random nparray
b

index = ['a','b','c','d','e']

c = pd.Series(b, index=index)
c

a    1.243727
b   -1.247351
c    0.754539
d    2.443219
e    0.635573
dtype: float64

In [7]:
#creating series from dictionary

d = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5}
pd.Series(d)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [8]:
#modifying the index of a series
a

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [9]:
a.index = ['a','b','c','d','e']
a

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [10]:
#slicing in pandas
a[1:3]
a[:5]
a[:-2]
a[-2:] #picks the last two

d    3
e    4
dtype: int64

In [11]:
d = a.append(c)  #appending 2 series
d

C:\Users\user\AppData\Local\Temp\ipykernel_12292\1778114031.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d = a.append(c)  #appending 2 series

a    0.000000
b    1.000000
c    2.000000
d    3.000000
e    4.000000
a    1.243727
b   -1.247351
c    0.754539
d    2.443219
e    0.635573
dtype: float64

In [12]:
d.drop('e') #dropping a label, row or column

a    0.000000
b    1.000000
c    2.000000
d    3.000000
a    1.243727
b   -1.247351
c    0.754539
d    2.443219
dtype: float64

In [13]:
#Series operation

f = [0,1,2,3,4,5,7,7]
g = [6,7,8,9,5]

In [14]:
h = pd.Series(g)
h

i = pd.Series(f)
i

0    0
1    1
2    2
3    3
4    4
5    5
6    7
7    7
dtype: int64

In [15]:
i.add(h)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
7     NaN
dtype: float64

In [16]:
h.sub(i)
h.div(i)
h.multiply(i)

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
7     NaN
dtype: float64

In [17]:
print('median:' '\n', i.median())
print('max:' '\n', i.max())
print('min:' '\n', i.min())
print('mode:' '\n', i.mode())

median:
 3.5
max:
 7
min:
 0
mode:
 0    7
dtype: int64

Creating a dataframe

In [18]:
dates=pd.date_range('today',periods=6) #Defining time sequence as index
dates

DatetimeIndex(['2022-09-18 18:08:23.137700', '2022-09-19 18:08:23.137700',
               '2022-09-20 18:08:23.137700', '2022-09-21 18:08:23.137700',
               '2022-09-22 18:08:23.137700', '2022-09-23 18:08:23.137700'],
              dtype='datetime64[ns]', freq='D')

In [19]:
num_arr = np.random.randn(6,4) #Numpy random array
num_arr

array([[-0.29077762,  0.44180701, -0.03876228, -0.48919263],
       [-0.8811304 ,  0.8246462 ,  0.19929524, -1.38562573],
       [ 0.30891161, -0.92694692,  0.09692182, -2.191045  ],
       [-0.08845292, -0.23332979,  0.61370303,  0.61866737],
       [-0.39618689,  0.56342914,  0.15346678,  1.27363376],
       [ 0.04004587, -0.26998017, -0.90971814, -1.08397572]])

In [20]:
columns = ['A', 'B', 'C', 'D']
columns

['A', 'B', 'C', 'D']

In [21]:
df1 = pd.DataFrame(num_arr, index=dates, columns = columns)
df1

                                   A         B         C         D
2022-09-18 18:08:23.137700 -0.290778  0.441807 -0.038762 -0.489193
2022-09-19 18:08:23.137700 -0.881130  0.824646  0.199295 -1.385626
2022-09-20 18:08:23.137700  0.308912 -0.926947  0.096922 -2.191045
2022-09-21 18:08:23.137700 -0.088453 -0.233330  0.613703  0.618667
2022-09-22 18:08:23.137700 -0.396187  0.563429  0.153467  1.273634
2022-09-23 18:08:23.137700  0.040046 -0.269980 -0.909718 -1.083976

In [22]:
#creating dataframe with a dictionary array

data = {'Animal':['cat', 'dog', 'snake', 'cat','goat', 'snake','cow', 'sheep', 'pig', 'dog'], 
        'age':[2.5,3,0.5, np.nan,5,2,4.5,np.nan,7,3], 
        'visits':[1,3,2,3,2,1,1,2,1, 1], 
        'priority':['yes', 'yes', 'no','yes','no','no','no','yes','no', 'no']}

labels = ['a','b','c','d','e','f','g','h','i','j']

df2 = pd.DataFrame(data, index = labels)
df2

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    cat  NaN       3      yes
e   goat  5.0       2       no
f  snake  2.0       1       no
g    cow  4.5       1       no
h  sheep  NaN       2      yes
i    pig  7.0       1       no
j    dog  3.0       1       no

In [23]:
#see datatypes of array
df2.dtypes

Animal       object
age         float64
visits        int64
priority     object
dtype: object

In [24]:
df3 = df2.head(6)
df3

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    cat  NaN       3      yes
e   goat  5.0       2       no
f  snake  2.0       1       no

In [25]:
df3 = df2.tail(3)
df3

  Animal  age  visits priority
h  sheep  NaN       2      yes
i    pig  7.0       1       no
j    dog  3.0       1       no

In [26]:
df2.index #checking the index pf the df2 dataframe
df2.columns #checking the columns of the df2 dataframe
df2.values #checking the data in the dataframe

array([['cat', 2.5, 1, 'yes'],
       ['dog', 3.0, 3, 'yes'],
       ['snake', 0.5, 2, 'no'],
       ['cat', nan, 3, 'yes'],
       ['goat', 5.0, 2, 'no'],
       ['snake', 2.0, 1, 'no'],
       ['cow', 4.5, 1, 'no'],
       ['sheep', nan, 2, 'yes'],
       ['pig', 7.0, 1, 'no'],
       ['dog', 3.0, 1, 'no']], dtype=object)

In [27]:
df2.describe() #checking the statistical data of dataframe

            age     visits
count  8.000000  10.000000
mean   3.437500   1.700000
std    2.007797   0.823273
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   1.500000
75%    4.625000   2.000000
max    7.000000   3.000000

In [28]:
df2.T #for transposing dataframe

            a    b      c    d     e      f    g      h    i    j
Animal    cat  dog  snake  cat  goat  snake  cow  sheep  pig  dog
age       2.5  3.0    0.5  NaN   5.0    2.0  4.5    NaN  7.0  3.0
visits      1    3      2    3     2      1    1      2    1    1
priority  yes  yes     no  yes    no     no   no    yes   no   no

In [29]:
df2.sort_values('age') #for sorting a dataframe with one of its data

  Animal  age  visits priority
c  snake  0.5       2       no
f  snake  2.0       1       no
a    cat  2.5       1      yes
b    dog  3.0       3      yes
j    dog  3.0       1       no
g    cow  4.5       1       no
e   goat  5.0       2       no
i    pig  7.0       1       no
d    cat  NaN       3      yes
h  sheep  NaN       2      yes

In [30]:
df2

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    cat  NaN       3      yes
e   goat  5.0       2       no
f  snake  2.0       1       no
g    cow  4.5       1       no
h  sheep  NaN       2      yes
i    pig  7.0       1       no
j    dog  3.0       1       no

In [31]:
df2[1:3] #slicing dataframe

  Animal  age  visits priority
b    dog  3.0       3      yes
c  snake  0.5       2       no

In [32]:
df2.iloc[1:3] #works like slicing. used to also query(locate) rows

  Animal  age  visits priority
b    dog  3.0       3      yes
c  snake  0.5       2       no

In [33]:
df2.sort_values(by='age')[:3]

  Animal  age  visits priority
c  snake  0.5       2       no
f  snake  2.0       1       no
a    cat  2.5       1      yes

In [34]:
#query a dataframe by tag

df2[['age', 'visits']] #extract age and visits from the dataframe

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       1
g  4.5       1
h  NaN       2
i  7.0       1
j  3.0       1

In [35]:
df3 = df2.copy()
df3

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    cat  NaN       3      yes
e   goat  5.0       2       no
f  snake  2.0       1       no
g    cow  4.5       1       no
h  sheep  NaN       2      yes
i    pig  7.0       1       no
j    dog  3.0       1       no

In [36]:
df3.isnull() #check where we have null values in a dataframe

   Animal    age  visits  priority
a   False  False   False     False
b   False  False   False     False
c   False  False   False     False
d   False   True   False     False
e   False  False   False     False
f   False  False   False     False
g   False  False   False     False
h   False   True   False     False
i   False  False   False     False
j   False  False   False     False

In [37]:
df3.loc['j', 'age'] = 1.5 #for updating and editing a dataframe
df3

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    cat  NaN       3      yes
e   goat  5.0       2       no
f  snake  2.0       1       no
g    cow  4.5       1       no
h  sheep  NaN       2      yes
i    pig  7.0       1       no
j    dog  1.5       1       no

In [38]:
df3.loc['f', 'Animal'] = 'cat' #for updating and editing a dataframe

In [39]:
df3.mean() #this show the mean of the numerical columns in the dataframe

C:\Users\user\AppData\Local\Temp\ipykernel_12292\1750850067.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.mean() #this show the mean of the numerical columns in the dataframe

age       3.25
visits    1.70
dtype: float64

In [40]:
df3[['age']].mean() #show the mean of the age columns
df3[['Animal']].mode() #show the mode of the Animal columns
df3[['visits']].median() #show the medium of the visits columns
df3[['visits']].sum() #show the sum of the visits columns
df3[['visits']].max() #show the maximum number in the visits columns

visits    3
dtype: int64

In [41]:
string = pd.Series(['A', 'B', 'C', 'D', 'Aaa', "BaCa", np.nan, 'CBA', 'cow', 'owl'])
string.str.lower() #turns all strings in to small letters
string.str.capitalize() #turns all strings in to capitalized letters

0       A
1       B
2       C
3       D
4     Aaa
5    Baca
6     NaN
7     Cba
8     Cow
9     Owl
dtype: object

#Working on DataFrame with missing values

In [42]:
df4 = df3.copy()
df4

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    cat  NaN       3      yes
e   goat  5.0       2       no
f    cat  2.0       1       no
g    cow  4.5       1       no
h  sheep  NaN       2      yes
i    pig  7.0       1       no
j    dog  1.5       1       no

In [43]:
df4.fillna(4) #filling missing values in df4 with 4

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    cat  4.0       3      yes
e   goat  5.0       2       no
f    cat  2.0       1       no
g    cow  4.5       1       no
h  sheep  4.0       2      yes
i    pig  7.0       1       no
j    dog  1.5       1       no

In [44]:
meanAge = df4[['age']].mean() #finding the mean of the age column
meanAge

age    3.25
dtype: float64

In [45]:
df4[['age']].fillna(meanAge) #filling missing values with mean of age columns

    age
a  2.50
b  3.00
c  0.50
d  3.25
e  5.00
f  2.00
g  4.50
h  3.25
i  7.00
j  1.50

In [46]:
df4.fillna(meanAge)

  Animal   age  visits priority
a    cat  2.50       1      yes
b    dog  3.00       3      yes
c  snake  0.50       2       no
d    cat  3.25       3      yes
e   goat  5.00       2       no
f    cat  2.00       1       no
g    cow  4.50       1       no
h  sheep  3.25       2      yes
i    pig  7.00       1       no
j    dog  1.50       1       no

In [47]:
df5 = df3.copy()
df5

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
d    cat  NaN       3      yes
e   goat  5.0       2       no
f    cat  2.0       1       no
g    cow  4.5       1       no
h  sheep  NaN       2      yes
i    pig  7.0       1       no
j    dog  1.5       1       no

In [48]:
df5.dropna(how='any') #droping any row with missing value

  Animal  age  visits priority
a    cat  2.5       1      yes
b    dog  3.0       3      yes
c  snake  0.5       2       no
e   goat  5.0       2       no
f    cat  2.0       1       no
g    cow  4.5       1       no
i    pig  7.0       1       no
j    dog  1.5       1       no

#DataFrame file operations

In [1]:
df3.to_csv('Animal.csv') #saving dataframe into csv format

NameError: name 'df3' is not defined

In [ ]:
df_animal = pd.read_csv('Animal.csv') #to display a csv file
df_animal.head()

In [ ]:
df3.to_excel('animal.xlsx', sheet_name = 'treatment') #saving dataframe into excel format

In [ ]:
df_animal2 = pd.read_excel('animal.xlsx', index_col=None, na_values=['N/A']) #reading excel file
df_animal2.head()

#Visualization in pandas

In [ ]:
%matplotlib inline

In [ ]:
ts = pd.Series(np.random.randn(50), index=pd.date_range('today', periods=50)) #creating a series
ts

In [ ]:
ts.cumsum()
ts.plot()

In [ ]:
df6 = pd.DataFrame(np.random.randn(50,4), index=ts.index, 
                   columns = ['A', 'B', 'X', 'Y'])
df6

In [ ]:
df6.cumsum()
df6.plot()

#Remove repeated data using pandas

In [ ]:
df7 = pd.DataFrame({'A': [1,2,2,2,4,4,5,5,6,6,7,8,8]})
df7.T

In [ ]:
df7.loc[df7['A'].shift() != df7['A']]

In [5]:
s.move("C:\\Users\\user\\Desktop\\SQL\\PANDAS TUTORIAL.ipynb", "C:\\Users\\user\\Desktop\\PYTHON FOR DATA SCIENCE")

'C:\\Users\\user\\Desktop\\PYTHON FOR DATA SCIENCE\\PANDAS TUTORIAL.ipynb'